In [1]:
"""pandas入门"""

'pandas入门'

In [2]:
"""pandas是专门处理表格和混杂数据的，这里混杂数据是啥？nosql吗？"""

'pandas是专门处理表格和混杂数据的，这里混杂数据是啥？nosql吗？'

In [3]:
import pandas as pd

In [4]:
from pandas import Series, DataFrame

In [5]:
obj = pd.Series([4,7,-5,3])

In [6]:
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values

array([ 4,  7, -5,  3])

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
"""这里需要values和index数量必须一致，否则报错"""
obj2 = pd.Series([1,2,3,4], index = ['a','b','c','d'])
print(obj2)

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
print(obj[2])
print(obj2['d'])

-5
4

In [11]:
print(obj2[obj2 > 2])

c    3
d    4
dtype: int64

In [12]:
obj2 * 2

a    2
b    4
c    6
d    8
dtype: int64

In [13]:
import numpy as np
np.exp(obj2)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [14]:
"""这里比较的是index"""
'a' in obj2

True

In [15]:
2 in obj2

False

In [16]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
print(obj3)

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [17]:
"""判断每个value的缺失值"""
pd.isnull(obj3)

Ohio      False
Oregon    False
Texas     False
Utah      False
dtype: bool

In [18]:
pd.notnull(obj3)

Ohio      True
Oregon    True
Texas     True
Utah      True
dtype: bool

In [19]:
obj2 + obj3

Ohio     NaN
Oregon   NaN
Texas    NaN
Utah     NaN
a        NaN
b        NaN
c        NaN
d        NaN
dtype: float64

In [20]:
stats = ['California', 'Ohio']
obj4 = pd.Series(sdata, index=stats)
print(obj4)

California        NaN
Ohio          35000.0
dtype: float64

In [21]:
obj3 + obj4

California        NaN
Ohio          70000.0
Oregon            NaN
Texas             NaN
Utah              NaN
dtype: float64

In [22]:
pd.isnull(obj3 + obj4)

California     True
Ohio          False
Oregon         True
Texas          True
Utah           True
dtype: bool

In [23]:
obj4.name = 'population'

In [24]:
obj4.index.name = 'stats'

In [25]:
obj4

stats
California        NaN
Ohio          35000.0
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [28]:
"""改变了index"""
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [29]:
"""接下来是dataFrame"""

'接下来是dataFrame'

In [30]:
"""每个map的数组数量必须一致"""
data = {'stat':['Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2003],'pop':[1.5, 1.7, 3.6, 2.9]}
print(data)
frame = pd.DataFrame(data)
print(frame)

{'stat': ['Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.9]}
   pop    stat  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6  Nevada  2002
3  2.9  Nevada  2003

In [31]:
frame.head

<bound method NDFrame.head of    pop    stat  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6  Nevada  2002
3  2.9  Nevada  2003>

In [32]:
frame.hist

<bound method hist_frame of    pop    stat  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6  Nevada  2002
3  2.9  Nevada  2003>

In [33]:
frame2 = pd.DataFrame(data ,columns=['year','month'])

In [34]:
frame2

   year month
0  2000   NaN
1  2001   NaN
2  2002   NaN
3  2003   NaN

In [35]:
frame2.columns

Index(['year', 'month'], dtype='object')

In [36]:
frame2.year

0    2000
1    2001
2    2002
3    2003
Name: year, dtype: int64

In [37]:
frame2.day

AttributeError: 'DataFrame' object has no attribute 'day'

In [ ]:
frame.month

In [ ]:
frame2.month

In [ ]:
frame2['day'] = 3

In [ ]:
frame2

In [ ]:
frame2['day'] = np.arange(4.)

In [ ]:
frame2

In [ ]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['1', '2','3'])

In [ ]:
val

In [ ]:
frame2['day'] = val

In [ ]:
frame2

In [ ]:
del frame2['day']

In [ ]:
frame2

In [ ]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7}}

In [ ]:
pop

In [ ]:
frame3 = pd.DataFrame(pop)

In [ ]:
frame3

In [ ]:
frame3.T

In [ ]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

In [ ]:
obj = pd.Series(range(3), index =['a',  'b', 'c'])

In [ ]:
obj

In [ ]:
index = obj.index
index

In [ ]:
index[1:]

In [ ]:
index[1] = 'f'

In [ ]:
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)

In [ ]:
obj3

In [ ]:
obj2

In [ ]:
obj2.index is labels

In [ ]:
obj3.index is labels

In [ ]:
frame2

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
'Ohio' in frame3.columns

In [38]:
obj = pd.Series([4.5,7.2,5.3,3.6], index=['d','b','a','c'])

In [39]:
obj

d    4.5
b    7.2
a    5.3
c    3.6
dtype: float64

In [41]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [42]:
obj2

a    5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [44]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a','b','c'],columns=['Ohio','Texas','Calif'])

In [45]:
frame

   Ohio  Texas  Calif
a     0      1      2
b     3      4      5
c     6      7      8

In [46]:
frame = frame.reindex(['a','b','f'])

In [47]:
frame

   Ohio  Texas  Calif
a   0.0    1.0    2.0
b   3.0    4.0    5.0
f   NaN    NaN    NaN

In [48]:
states = ['Ohio','Utah','Calif']

In [49]:
frame.reindex(columns=states)

   Ohio  Utah  Calif
a   0.0   NaN    2.0
b   3.0   NaN    5.0
f   NaN   NaN    NaN

In [50]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])

In [51]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [52]:
new_obj =obj.drop('c')

In [53]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [54]:
new_obj = obj.drop('Z')

ValueError: labels ['Z'] not contained in axis

In [55]:
obj['b','c'] =  5

In [56]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
e    4.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio','Co','Utah','new York'],columns=['1','2','3','4'])

In [58]:
data

           1   2   3   4
Ohio       0   1   2   3
Co         4   5   6   7
Utah       8   9  10  11
new York  12  13  14  15

In [59]:
data['2']

Ohio         1
Co           5
Utah         9
new York    13
Name: 2, dtype: int64

In [60]:
data[:2]

      1  2  3  4
Ohio  0  1  2  3
Co    4  5  6  7

In [61]:
data < 5

              1      2      3      4
Ohio       True   True   True   True
Co         True  False  False  False
Utah      False  False  False  False
new York  False  False  False  False

In [62]:
data.loc['Co',['2','3']]

2    5
3    6
Name: Co, dtype: int64

In [63]:
data.iloc[2,[3,0,1]]

4    11
1     8
2     9
Name: Utah, dtype: int64

In [64]:
data.iloc[2]

1     8
2     9
3    10
4    11
Name: Utah, dtype: int64

In [65]:
data.loc[:'Utah','2']

Ohio    1
Co      5
Utah    9
Name: 2, dtype: int64

In [66]:
ser2 = pd.Series(np.arange(3),index = ['a','b','c'])

In [67]:
ser2

a    0
b    1
c    2
dtype: int64

In [68]:
ser2[-1]

2

In [72]:
s1 = pd.Series([7.3,-2.5,3.4,1.5],index=['a',
                                        'b',
                                        'c','d'])

In [73]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1,],index=['a','b','b','c','e'])

In [74]:
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [75]:
s2

a   -2.1
b    3.6
b   -1.5
c    4.0
e    3.1
dtype: float64

In [76]:
s1 + s2

a    5.2
b    1.1
b   -4.0
c    7.4
d    NaN
e    NaN
dtype: float64

In [77]:
arr = np.arange(12.).reshape((3,4))

In [78]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [79]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [80]:
arr -arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [81]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['1','2','3','4'])

In [82]:
frame

     b     d     e
1  0.0   1.0   2.0
2  3.0   4.0   5.0
3  6.0   7.0   8.0
4  9.0  10.0  11.0

In [83]:
series = frame.iloc[0]

In [84]:
series

b    0.0
d    1.0
e    2.0
Name: 1, dtype: float64

In [85]:
frame - series

     b    d    e
1  0.0  0.0  0.0
2  3.0  3.0  3.0
3  6.0  6.0  6.0
4  9.0  9.0  9.0

In [86]:
frame + series

     b     d     e
1  0.0   2.0   4.0
2  3.0   5.0   7.0
3  6.0   8.0  10.0
4  9.0  11.0  13.0

In [87]:
frame

     b     d     e
1  0.0   1.0   2.0
2  3.0   4.0   5.0
3  6.0   7.0   8.0
4  9.0  10.0  11.0

In [88]:
np.abs(frame)

     b     d     e
1  0.0   1.0   2.0
2  3.0   4.0   5.0
3  6.0   7.0   8.0
4  9.0  10.0  11.0

In [89]:
f = lambda x:x.max() - x.min()

In [90]:
f

In [91]:
frame.apply(f)

b    9.0
d    9.0
e    9.0
dtype: float64

In [92]:
frame.apply(f,axis='columns')

1    2.0
2    2.0
3    2.0
4    2.0
dtype: float64

In [93]:
format = lambda x:'%.2f' % x

In [94]:
frame.applymap(format)

      b      d      e
1  0.00   1.00   2.00
2  3.00   4.00   5.00
3  6.00   7.00   8.00
4  9.00  10.00  11.00

In [95]:
frame['d'].map(format)

1     1.00
2     4.00
3     7.00
4    10.00
Name: d, dtype: object

In [96]:
frame.sort_index()

     b     d     e
1  0.0   1.0   2.0
2  3.0   4.0   5.0
3  6.0   7.0   8.0
4  9.0  10.0  11.0

In [97]:
frame.sort_index(axis=1)

     b     d     e
1  0.0   1.0   2.0
2  3.0   4.0   5.0
3  6.0   7.0   8.0
4  9.0  10.0  11.0

In [98]:
frame.sort_index(axis=1,ascending=False)

      e     d    b
1   2.0   1.0  0.0
2   5.0   4.0  3.0
3   8.0   7.0  6.0
4  11.0  10.0  9.0

In [100]:
obj = pd.Series([4,7,-3,2])

In [101]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [102]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [103]:
frame.sort_values(by='b')

     b     d     e
1  0.0   1.0   2.0
2  3.0   4.0   5.0
3  6.0   7.0   8.0
4  9.0  10.0  11.0

In [104]:
obj.rank()

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [106]:
obj.rank(method='first')

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [107]:
obj = pd.Series(['a','a','b','b','e'])

In [108]:
obj

0    a
1    a
2    b
3    b
4    e
dtype: object

In [109]:
obj.index.is_unique

True

In [111]:
df = pd.DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [112]:
df

          0         1         2
a -0.748108 -1.981175 -0.990305
a -0.178429 -1.488875 -0.546952
b  0.238421  1.246544  0.838635
b  0.372405  0.183875 -0.431223

In [113]:
df.loc['b']

          0         1         2
b  0.238421  1.246544  0.838635
b  0.372405  0.183875 -0.431223

In [114]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan, np.nan],[0.75,-1.3]],index=['a','b','c','c'],columns=['1','2'])

In [115]:
df

      1    2
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
c  0.75 -1.3

In [116]:
df.sum()

1    9.25
2   -5.80
dtype: float64

In [117]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
c   -0.55
dtype: float64

In [118]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
c   -0.275
dtype: float64

In [119]:
df.idxmax()

1    b
2    c
dtype: object

In [120]:
df.cumsum()

      1    2
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
c  9.25 -5.8

In [121]:
df.describe()

              1         2
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [122]:
import pandas_datareader as web

In [123]:
all_data = {ticker:web.get_data_yahoo(ticker) for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [124]:
all_data

{'AAPL':                   Open        High         Low       Close   Adj Close  \
 Date
 2009-12-31   30.447144   30.478571   30.080000   30.104286   26.372231
 2010-01-04   30.490000   30.642857   30.340000   30.572857   26.782711
 2010-01-05   30.657143   30.798571   30.464285   30.625713   26.829010
 2010-01-06   30.625713   30.747143   30.107143   30.138571   26.402260
 2010-01-07   30.250000   30.285715   29.864286   30.082857   26.353460
 2010-01-08   30.042856   30.285715   29.865715   30.282858   26.528664
 2010-01-11   30.400000   30.428572   29.778572   30.015715   26.294640
 2010-01-12   29.884285   29.967142   29.488571   29.674286   25.995537
 2010-01-13   29.695715   30.132856   29.157143   30.092857   26.362217
 2010-01-14   30.015715   30.065714   29.860001   29.918571   26.209538
 2010-01-15   30.132856   30.228571   29.410000   29.418571   25.771528
 2010-01-19   29.761429   30.741428   29.605715   30.719999   26.911612
 2010-01-20   30.701429   30.792856   29.928572   30.247143   26.497383
 2010-01-21   30.297142   30.472857   29.601429   29.724285   26.039341
 2010-01-22   29.540001   29.642857   28.165714   28.250000   24.747818
 2010-01-25   28.930000   29.242857   28.598572   29.010000   25.413599
 2010-01-26   29.421429   30.530001   28.940001   29.420000   25.772774
 2010-01-27   29.549999   30.082857   28.504286   29.697144   26.015560
 2010-01-28   29.275715   29.357143   28.385714   28.469999   24.940546
 2010-01-29   28.725714   28.885714   27.178572   27.437143   24.035734
 2010-02-01   27.481428   28.000000   27.328571   27.818571   24.369871
 2010-02-02   27.987143   28.045713   27.625713   27.980000   24.511295
 2010-02-03   27.881428   28.600000   27.774286   28.461428   24.933033
 2010-02-04   28.104286   28.338572   27.367144   27.435715   24.034487
 2010-02-05   27.518572   28.000000   27.264286   27.922857   24.461227
 2010-02-08   27.955715   28.268572   27.714285   27.731428   24.293537
 2010-02-09   28.059999   28.214285   27.821428   28.027143   24.552589
 2010-02-10   27.984285   28.085714   27.751429   27.874287   24.418684
 2010-02-11   27.840000   28.535715   27.722857   28.381428   24.862957
 2010-02-12   28.301428   28.805714   27.928572   28.625713   25.076958
 ...                ...         ...         ...         ...         ...
 2019-05-15  186.270004  191.750000  186.020004  190.919998  190.919998
 2019-05-16  189.910004  192.470001  188.839996  190.080002  190.080002
 2019-05-17  186.929993  190.899994  186.759995  189.000000  189.000000
 2019-05-20  183.520004  184.350006  180.279999  183.089996  183.089996
 2019-05-21  185.220001  188.000000  184.699997  186.600006  186.600006
 2019-05-22  184.660004  185.710007  182.550003  182.779999  182.779999
 2019-05-23  179.800003  180.539993  177.809998  179.660004  179.660004
 2019-05-24  180.199997  182.139999  178.619995  178.970001  178.970001
 2019-05-28  178.919998  180.589996  177.910004  178.229996  178.229996
 2019-05-29  176.419998  179.350006  176.000000  177.380005  177.380005
 2019-05-30  177.949997  179.229996  176.669998  178.300003  178.300003
 2019-05-31  176.229996  177.990005  174.990005  175.070007  175.070007
 2019-06-03  175.600006  177.919998  170.270004  173.300003  173.300003
 2019-06-04  175.440002  179.830002  174.520004  179.639999  179.639999
 2019-06-05  184.279999  184.990005  181.139999  182.539993  182.539993
 2019-06-06  183.080002  185.470001  182.149994  185.220001  185.220001
 2019-06-07  186.509995  191.919998  185.770004  190.149994  190.149994
 2019-06-10  191.809998  195.369995  191.619995  192.580002  192.580002
 2019-06-11  194.860001  196.000000  193.600006  194.809998  194.809998
 2019-06-12  193.949997  195.970001  193.389999  194.190002  194.190002
 2019-06-13  194.699997  196.789993  193.600006  194.149994  194.149994
 2019-06-14  191.550003  193.589996  190.300003  192.740005  192.740005
 2019-06-17  192.899994  194.960007  192.169998  193.889999  193.889999
 2019-06-18  196.050003  200.289993  195.210007  198.449997  198.449997
 2019-06-19  199.679993  199.880005  197.309998  197.869995  197.869995
 2019-06-20  200.369995  200.610001  198.029999  199.460007  199.460007
 2019-06-21  198.800003  200.850006  198.149994  198.779999  198.779999
 2019-06-24  198.539993  200.160004  198.169998  198.580002  198.580002
 2019-06-25  198.429993  199.259995  195.289993  195.570007  195.570007
 2019-06-26  197.770004  200.990005  197.350006  200.000000  200.000000

                Volume
 Date
 2009-12-31   88102700
 2010-01-04  123432400
 2010-01-05  150476200
 2010-01-06  138040000
 2010-01-07  119282800
 2010-01-08  111902700
 2010-01-11  115557400
 2010-01-12  148614900
 2010-01-13  151473000
 2010-01-14  108223500
 2010-01-15  148516900
 2010-01-19  182501900
 2010-01-20  153038200
 2010-01-21  152038600
 2010-01-22  220441900
 2010-01-25  266424900
 2010-01-26  466777500
 2010-01-27  430642100
 2010-01-28  293375600
 2010-01-29  311488100
 2010-02-01  187469100
 2010-02-02  174585600
 2010-02-03  153832000
 2010-02-04  189413000
 2010-02-05  212576700
 2010-02-08  119567700
 2010-02-09  158221700
 2010-02-10   92590400
 2010-02-11  137586400
 2010-02-12  163867200
 ...               ...
 2019-05-15   26544700
 2019-05-16   33031400
 2019-05-17   32879100
 2019-05-20   38612300
 2019-05-21   28364800
 2019-05-22   29748600
 2019-05-23   36529700
 2019-05-24   23714700
 2019-05-28   27948200
 2019-05-29   28481200
 2019-05-30   21218400
 2019-05-31   27043600
 2019-06-03   40396100
 2019-06-04   30968000
 2019-06-05   29773400
 2019-06-06   22526300
 2019-06-07   30684400
 2019-06-10   26220900
 2019-06-11   26932900
 2019-06-12   18253200
 2019-06-13   21674600
 2019-06-14   18761500
 2019-06-17   14651700
 2019-06-18   26551000
 2019-06-19   21124200
 2019-06-20   21514000
 2019-06-21   47800600
 2019-06-24   18220400
 2019-06-25   21047200
 2019-06-26    7247616

 [2387 rows x 6 columns],
 'GOOG':                    Open         High          Low        Close    Adj Close  \
 Date
 2009-12-31   310.356445   310.679321   307.986847   307.986847   307.986847
 2010-01-04   311.449310   312.721039   310.103088   311.349976   311.349976
 2010-01-05   311.563568   311.891449   308.761810   309.978882   309.978882
 2010-01-06   310.907837   310.907837   301.220856   302.164703   302.164703
 2010-01-07   302.731018   303.029083   294.410156   295.130463   295.130463
 2010-01-08   294.087250   299.675903   292.651581   299.064880   299.064880
 2010-01-11   300.276978   300.276978   295.100647   298.612823   298.612823
 2010-01-12   296.893982   297.147339   292.100159   293.332153   293.332153
 2010-01-13   286.382355   292.288940   285.095734   291.648102   291.648102
 2010-01-14   290.063416   295.180145   289.521942   293.019196   293.019196
 2010-01-15   294.752930   294.862213   287.152344   288.126007   288.126007
 2010-01-19   288.722137   293.302338   286.283020   291.911407   291.911407
 2010-01-20   291.096710   291.096710   285.786224   288.329681   288.329681
 2010-01-21   289.834900   291.513977   284.276062   289.606384   289.606384
 2010-01-22   280.426086   283.456390   265.701874   273.227905   273.227905
 2010-01-25   271.528961   273.163330   266.024780   268.255249   268.255249
 2010-01-26   267.246826   273.024231   266.412231   269.457428   269.457428
 2010-01-27   268.886169   272.055542   265.925415   269.298462   269.298462
 2010-01-28   270.485748   271.732635   263.585632   265.418701   265.418701
 2010-01-29   267.505127   268.747070   261.106750   263.257751   263.257751
 2010-02-01   265.572693   266.173798   263.436584   264.787811   264.787811
 2010-02-02   265.751556   265.751556   262.100281   263.843964   263.843964
 2010-02-03   262.626862   269.298462   262.408295   268.662598   268.662598
 2010-02-04   266.764954   267.261719   261.081909   261.687958   261.687958
 2010-02-05   262.492737   265.026245   259.541931   263.928406   263.928406
 2010-02-08   264.529480   269.248810   264.047638   265.011353   265.011353
 2010-02-09   268.026733   269.015320   265.806183   266.486755   266.486755
 2010-02-10   265.309418   267.157410   262.140045   265.498199   265.498199
 2010-02-11   264.936829   268.498688   263.039185   266.466888   266.466888
 2010-02-12   264.762970   266.839478   263.535950   264.837494   264.837494
 ...                 ...          ...          ...          ...          ...
 2019-05-15  1117.869995  1171.329956  1116.666016  1164.209961  1164.209961
 2019-05-16  1164.510010  1188.160034  1162.839966  1178.979980  1178.979980
 2019-05-17  1168.469971  1180.150024  1160.010010  1162.300049  1162.300049
 2019-05-20  1144.500000  1146.796997  1131.442993  1138.849976  1138.849976
 2019-05-21  1148.489990  1152.708008  1137.939941  1149.630005  1149.630005
 2019-05-22  1146.750000  1158.520020  1145.890015  1151.420044  1151.420044
 2019-05-23  1140.500000  1145.973022  1129.223999  1140.770020  1140.770020
 2019-05-24  1147.359985  1149.765015  1131.660034  1133.469971  1133.469971
 2019-05-28  1134.000000  1151.587036  1133.119995  1134.150024  1134.150024
 2019-05-29  1127.520020  1129.099976  1108.219971  1116.459961  1116.459961
 2019-05-30  1115.540039  1123.130005  1112.119995  1117.949951  1117.949951
 2019-05-31  1101.290039  1109.599976  1100.180054  1103.630005  1103.630005
 2019-06-03  1065.500000  1065.500000  1025.000000  1036.229980  1036.229980
 2019-06-04  1042.900024  1056.050049  1033.689941  1053.050049  1053.050049
 2019-06-05  1051.540039  1053.550049  1030.489990  1042.219971  1042.219971
 2019-06-06  1044.989990  1047.489990  1033.699951  1044.339966  1044.339966
 2019-06-07  1050.630005  1070.920044  1048.400024  1066.040039  1066.040039
 2019-06-10  1072.979980  1092.660034  1072.322021  1080.380005  1080.380005
 2019-06-11  1093.979980  1101.989990  1077.603027  1078.719971  1078.719971
 2019-06-12  1078.000000  1080.930054  1067.540039  1077.030029  1077.030029
 2019-06-13  1083.640015  1094.170044  1080.150024  1088.770020  1088.770020
 2019-06-14  1086.420044  1092.689941  1080.171997  1085.349976  1085.349976
 2019-06-17  1086.280029  1099.180054  1086.280029  1092.500000  1092.500000
 2019-06-18  1109.689941  1116.390015  1098.989990  1103.599976  1103.599976
 2019-06-19  1105.599976  1107.000000  1093.479980  1102.329956  1102.329956
 2019-06-20  1119.989990  1120.119995  1104.739990  1111.420044  1111.420044
 2019-06-21  1109.239990  1124.109985  1108.079956  1121.880005  1121.880005
 2019-06-24  1119.609985  1122.000000  1111.010010  1115.520020  1115.520020
 2019-06-25  1112.660034  1114.349976  1083.800049  1086.349976  1086.349976
 2019-06-26  1086.500000  1092.810059  1084.540039  1087.290039  1087.290039

               Volume
 Date
 2009-12-31   2455400
 2010-01-04   3937800
 2010-01-05   6048500
 2010-01-06   8009000
 2010-01-07  12912000
 2010-01-08   9509900
 2010-01-11  14519600
 2010-01-12   9769600
 2010-01-13  13077600
 2010-01-14   8535300
 2010-01-15  10939600
 2010-01-19   8689500
 2010-01-20   6543600
 2010-01-21  12697400
 2010-01-22  13689200
 2010-01-25   8897200
 2010-01-26   8767600
 2010-01-27   7980200
 2010-01-28   6500100
 2010-01-29   8334700
 2010-02-01   4530800
 2010-02-02   8245600
 2010-02-03   6037000
 2010-02-04   6799200
 2010-02-05   6353000
 2010-02-08   5423500
 2010-02-09   5675700
 2010-02-10   5383700
 2010-02-11   4851300
 2010-02-12   4589000
 ...              ...
 2019-05-15   2289300
 2019-05-16   1531400
 2019-05-17   1208600
 2019-05-20   1353300
 2019-05-21   1159800
 2019-05-22    914500
 2019-05-23   1198900
 2019-05-24   1112000
 2019-05-28   1365000
 2019-05-29   1538200
 2019-05-30    951900
 2019-05-31   1507800
 2019-06-03   5130600
 2019-06-04   2833500
 2019-06-05   2168400
 2019-06-06   1703200
 2019-06-07   1802400
 2019-06-10   1464200
 2019-06-11   1436700
 2019-06-12   1061000
 2019-06-13   1057700
 2019-06-14   1111500
 2019-06-17    941600
 2019-06-18   1386700
 2019-06-19   1338800
 2019-06-20   1262000
 2019-06-21   1947600
 2019-06-24   1395600
 2019-06-25   1546300
 2019-06-26    367636

 [2387 rows x 6 columns],
 'IBM':                   Open        High         Low       Close   Adj Close  \
 Date
 2009-12-31  132.410004  132.850006  130.750000  130.899994   98.137283
 2010-01-04  131.179993  132.970001  130.850006  132.449997   99.299347
 2010-01-05  131.679993  131.850006  130.100006  130.850006   98.099792
 2010-01-06  130.679993  131.490005  129.809998  130.000000   97.462532
 2010-01-07  129.869995  130.250000  128.910004  129.550003   97.125160
 2010-01-08  129.070007  130.919998  129.050003  130.850006   98.099792
 2010-01-11  131.059998  131.059998  128.669998  129.479996   97.072685
 2010-01-12  129.029999  131.330002  129.000000  130.509995   97.844872
 2010-01-13  130.389999  131.119995  129.160004  130.229996   97.634964
 2010-01-14  130.550003  132.710007  129.910004  132.309998   99.194389
 2010-01-15  132.029999  132.889999  131.089996  131.779999   98.797028
 2010-01-19  131.630005  134.250000  131.559998  134.139999  100.566330
 2010-01-20  130.460007  131.149994  128.949997  130.250000   97.649979
 2010-01-21  130.470001  130.690002  128.059998  129.000000   96.712860
 2010-01-22  128.669998  128.889999  125.370003  125.500000   94.088844
 2010-01-25  126.330002  126.889999  125.709999  126.120003   94.553688
 2010-01-26  125.919998  127.750000  125.410004  125.750000   94.276276
 2010-01-27  125.820000  126.959999  125.040001  126.330002   94.711105
 2010-01-28  127.029999  127.040001  123.050003  123.750000   92.776848
 2010-01-29  124.320000  125.000000  121.900002  122.389999   91.757233
 2010-02-01  123.230003  124.949997  122.779999  124.669998   93.466576
 2010-02-02  124.790001  125.809998  123.949997  125.529999   94.111336
 2010-02-03  125.160004  126.070000  125.070000  125.660004   94.208817
 2010-02-04  125.190002  125.440002  122.900002  123.000000   92.214569
 2010-02-05  123.040001  123.720001  121.830002  123.519997   92.604401
 2010-02-08  123.150002  123.220001  121.739998  121.879997   91.783577
 2010-02-09  122.650002  124.199997  122.459999  123.209999   92.785126
 2010-02-10  122.940002  123.650002  122.209999  122.809998   92.483902
 2010-02-11  122.580002  124.199997  122.059998  123.730003   93.176750
 2010-02-12  123.010002  124.050003  121.610001  124.000000   93.380051
 ...                ...         ...         ...         ...         ...
 2019-05-15  132.589996  134.589996  132.369995  134.399994  134.399994
 2019-05-16  134.740005  136.110001  134.639999  135.880005  135.880005
 2019-05-17  134.679993  135.410004  133.940002  134.320007  134.320007
 2019-05-20  133.529999  135.429993  132.929993  135.119995  135.119995
 2019-05-21  136.119995  137.059998  135.789993  136.449997  136.449997
 2019-05-22  136.000000  136.750000  135.710007  136.350006  136.350006
 2019-05-23  135.130005  135.130005  130.440002  132.389999  132.389999
 2019-05-24  133.529999  134.250000  131.589996  132.279999  132.279999
 2019-05-28  132.130005  132.639999  130.270004  130.460007  130.460007
 2019-05-29  130.000000  130.279999  128.320007  129.690002  129.690002
 2019-05-30  129.740005  129.970001  128.929993  129.570007  129.570007
 2019-05-31  128.440002  128.440002  126.849998  126.989998  126.989998
 2019-06-03  127.099998  128.559998  127.059998  128.270004  128.270004
 2019-06-04  129.559998  132.740005  129.089996  132.690002  132.690002
 2019-06-05  133.380005  133.610001  130.470001  131.490005  131.490005
 2019-06-06  132.190002  132.649994  130.899994  132.220001  132.220001
 2019-06-07  132.470001  134.720001  132.210007  133.309998  133.309998
 2019-06-10  134.380005  135.350006  133.910004  134.740005  134.740005
 2019-06-11  135.320007  136.460007  135.050003  135.949997  135.949997
 2019-06-12  135.559998  135.940002  134.410004  134.869995  134.869995
 2019-06-13  135.130005  136.270004  135.089996  135.759995  135.759995
 2019-06-14  135.440002  135.880005  134.429993  135.149994  135.149994
 2019-06-17  135.389999  136.029999  134.699997  134.949997  134.949997
 2019-06-18  135.199997  137.190002  135.199997  136.380005  136.380005
 2019-06-19  136.429993  138.360001  136.240005  137.080002  137.080002
 2019-06-20  138.929993  139.539993  138.199997  138.850006  138.850006
 2019-06-21  138.440002  139.539993  138.389999  139.199997  139.199997
 2019-06-24  139.199997  140.149994  139.050003  139.350006  139.350006
 2019-06-25  139.460007  139.550003  138.130005  138.360001  138.360001
 2019-06-26  138.869995  139.679993  138.651993  139.369995  139.369995

               Volume
 Date
 2009-12-31   4223400
 2010-01-04   6155300
 2010-01-05   6841400
 2010-01-06   5605300
 2010-01-07   5840600
 2010-01-08   4197200
 2010-01-11   5730400
 2010-01-12   8081500
 2010-01-13   6455400
 2010-01-14   7111800
 2010-01-15   8494400
 2010-01-19  13916200
 2010-01-20  15197500
 2010-01-21   9608600
 2010-01-22  10088600
 2010-01-25   5738500
 2010-01-26   7135300
 2010-01-27   8719200
 2010-01-28   9622200
 2010-01-29  11571200
 2010-02-01   7242900
 2010-02-02   5899900
 2010-02-03   4177100
 2010-02-04   9126900
 2010-02-05   8617000
 2010-02-08   5718500
 2010-02-09   6044500
 2010-02-10   5219100
 2010-02-11   5089000
 2010-02-12   8017700
 ...              ...
 2019-05-15   2551000
 2019-05-16   3017300
 2019-05-17   2619100
 2019-05-20   3264500
 2019-05-21   2503500
 2019-05-22   1849800
 2019-05-23   5343400
 2019-05-24   2596100
 2019-05-28   4908800
 2019-05-29   3679000
 2019-05-30   2741900
 2019-05-31   3539300
 2019-06-03   4266900
 2019-06-04   3913500
 2019-06-05   3161300
 2019-06-06   2298200
 2019-06-07   2553400
 2019-06-10   2911300
 2019-06-11   3407300
 2019-06-12   2254700
 2019-06-13   2955300
 2019-06-14   2193300
 2019-06-17   2194100
 2019-06-18   2914700
 2019-06-19   2382400
 2019-06-20   3071000
 2019-06-21   5288700
 2019-06-24   2186000
 2019-06-25   2801200
 2019-06-26    372574

 [2387 rows x 6 columns],
 'MSFT':                   Open        High         Low       Close   Adj Close  \
 Date
 2009-12-31   30.980000   30.990000   30.480000   30.480000   24.152580
 2010-01-04   30.620001   31.100000   30.590000   30.950001   24.525019
 2010-01-05   30.850000   31.100000   30.639999   30.959999   24.532942
 2010-01-06   30.879999   31.080000   30.520000   30.770000   24.382378
 2010-01-07   30.629999   30.700001   30.190001   30.450001   24.128809
 2010-01-08   30.280001   30.879999   30.240000   30.660000   24.295214
 2010-01-11   30.709999   30.760000   30.120001   30.270000   23.986179
 2010-01-12   30.150000   30.400000   29.910000   30.070000   23.827694
 2010-01-13   30.260000   30.520000   30.010000   30.350000   24.049570
 2010-01-14   30.309999   31.100000   30.260000   30.959999   24.532942
 2010-01-15   31.080000   31.240000   30.709999   30.860001   24.453693
 2010-01-19   30.750000   31.240000   30.680000   31.100000   24.643881
 2010-01-20   30.809999   30.940001   30.309999   30.590000   24.239746
 2010-01-21   30.610001   30.719999   30.000000   30.010000   23.780155
 2010-01-22   30.000000   30.200001   28.840000   28.959999   22.948128
 2010-01-25   29.240000   29.660000   29.100000   29.320000   23.233395
 2010-01-26   29.200001   29.850000   29.090000   29.500000   23.376024
 2010-01-27   29.350000   29.820000   29.020000   29.670000   23.510740
 2010-01-28   29.840000   29.870001   28.889999   29.160000   23.106604
 2010-01-29   29.900000   29.920000   27.660000   28.180000   22.330048
 2010-02-01   28.389999   28.480000   27.920000   28.410000   22.512297
 2010-02-02   28.370001   28.500000   28.139999   28.459999   22.551926
 2010-02-03   28.260000   28.790001   28.120001   28.629999   22.686628
 2010-02-04   28.379999   28.500000   27.809999   27.840000   22.060629
 2010-02-05   28.000000   28.280001   27.570000   28.020000   22.203266
 2010-02-08   28.010000   28.080000   27.570000   27.719999   21.965540

In [125]:
print(all_data)

{'AAPL':                   Open        High         Low       Close   Adj Close  \
Date
2009-12-31   30.447144   30.478571   30.080000   30.104286   26.372231
2010-01-04   30.490000   30.642857   30.340000   30.572857   26.782711
2010-01-05   30.657143   30.798571   30.464285   30.625713   26.829010
2010-01-06   30.625713   30.747143   30.107143   30.138571   26.402260
2010-01-07   30.250000   30.285715   29.864286   30.082857   26.353460
2010-01-08   30.042856   30.285715   29.865715   30.282858   26.528664
2010-01-11   30.400000   30.428572   29.778572   30.015715   26.294640
2010-01-12   29.884285   29.967142   29.488571   29.674286   25.995537
2010-01-13   29.695715   30.132856   29.157143   30.092857   26.362217
2010-01-14   30.015715   30.065714   29.860001   29.918571   26.209538
2010-01-15   30.132856   30.228571   29.410000   29.418571   25.771528
2010-01-19   29.761429   30.741428   29.605715   30.719999   26.911612
2010-01-20   30.701429   30.792856   29.928572   30.247143   26.497383
2010-01-21   30.297142   30.472857   29.601429   29.724285   26.039341
2010-01-22   29.540001   29.642857   28.165714   28.250000   24.747818
2010-01-25   28.930000   29.242857   28.598572   29.010000   25.413599
2010-01-26   29.421429   30.530001   28.940001   29.420000   25.772774
2010-01-27   29.549999   30.082857   28.504286   29.697144   26.015560
2010-01-28   29.275715   29.357143   28.385714   28.469999   24.940546
2010-01-29   28.725714   28.885714   27.178572   27.437143   24.035734
2010-02-01   27.481428   28.000000   27.328571   27.818571   24.369871
2010-02-02   27.987143   28.045713   27.625713   27.980000   24.511295
2010-02-03   27.881428   28.600000   27.774286   28.461428   24.933033
2010-02-04   28.104286   28.338572   27.367144   27.435715   24.034487
2010-02-05   27.518572   28.000000   27.264286   27.922857   24.461227
2010-02-08   27.955715   28.268572   27.714285   27.731428   24.293537
2010-02-09   28.059999   28.214285   27.821428   28.027143   24.552589
2010-02-10   27.984285   28.085714   27.751429   27.874287   24.418684
2010-02-11   27.840000   28.535715   27.722857   28.381428   24.862957
2010-02-12   28.301428   28.805714   27.928572   28.625713   25.076958
...                ...         ...         ...         ...         ...
2019-05-15  186.270004  191.750000  186.020004  190.919998  190.919998
2019-05-16  189.910004  192.470001  188.839996  190.080002  190.080002
2019-05-17  186.929993  190.899994  186.759995  189.000000  189.000000
2019-05-20  183.520004  184.350006  180.279999  183.089996  183.089996
2019-05-21  185.220001  188.000000  184.699997  186.600006  186.600006
2019-05-22  184.660004  185.710007  182.550003  182.779999  182.779999
2019-05-23  179.800003  180.539993  177.809998  179.660004  179.660004
2019-05-24  180.199997  182.139999  178.619995  178.970001  178.970001
2019-05-28  178.919998  180.589996  177.910004  178.229996  178.229996
2019-05-29  176.419998  179.350006  176.000000  177.380005  177.380005
2019-05-30  177.949997  179.229996  176.669998  178.300003  178.300003
2019-05-31  176.229996  177.990005  174.990005  175.070007  175.070007
2019-06-03  175.600006  177.919998  170.270004  173.300003  173.300003
2019-06-04  175.440002  179.830002  174.520004  179.639999  179.639999
2019-06-05  184.279999  184.990005  181.139999  182.539993  182.539993
2019-06-06  183.080002  185.470001  182.149994  185.220001  185.220001
2019-06-07  186.509995  191.919998  185.770004  190.149994  190.149994
2019-06-10  191.809998  195.369995  191.619995  192.580002  192.580002
2019-06-11  194.860001  196.000000  193.600006  194.809998  194.809998
2019-06-12  193.949997  195.970001  193.389999  194.190002  194.190002
2019-06-13  194.699997  196.789993  193.600006  194.149994  194.149994
2019-06-14  191.550003  193.589996  190.300003  192.740005  192.740005
2019-06-17  192.899994  194.960007  192.169998  193.889999  193.889999
2019-06-18  196.050003  200.289993  195.210007  198.449997  198.449997
2019-06-19  199.679993  199.880005  197.309998  197.869995  197.869995
2019-06-20  200.369995  200.610001  198.029999  199.460007  199.460007
2019-06-21  198.800003  200.850006  198.149994  198.779999  198.779999
2019-06-24  198.539993  200.160004  198.169998  198.580002  198.580002
2019-06-25  198.429993  199.259995  195.289993  195.570007  195.570007
2019-06-26  197.770004  200.990005  197.350006  200.000000  200.000000

               Volume
Date
2009-12-31   88102700
2010-01-04  123432400
2010-01-05  150476200
2010-01-06  138040000
2010-01-07  119282800
2010-01-08  111902700
2010-01-11  115557400
2010-01-12  148614900
2010-01-13  151473000
2010-01-14  108223500
2010-01-15  148516900
2010-01-19  182501900
2010-01-20  153038200
2010-01-21  152038600
2010-01-22  220441900
2010-01-25  266424900
2010-01-26  466777500
2010-01-27  430642100
2010-01-28  293375600
2010-01-29  311488100
2010-02-01  187469100
2010-02-02  174585600
2010-02-03  153832000
2010-02-04  189413000
2010-02-05  212576700
2010-02-08  119567700
2010-02-09  158221700
2010-02-10   92590400
2010-02-11  137586400
2010-02-12  163867200
...               ...
2019-05-15   26544700
2019-05-16   33031400
2019-05-17   32879100
2019-05-20   38612300
2019-05-21   28364800
2019-05-22   29748600
2019-05-23   36529700
2019-05-24   23714700
2019-05-28   27948200
2019-05-29   28481200
2019-05-30   21218400
2019-05-31   27043600
2019-06-03   40396100
2019-06-04   30968000
2019-06-05   29773400
2019-06-06   22526300
2019-06-07   30684400
2019-06-10   26220900
2019-06-11   26932900
2019-06-12   18253200
2019-06-13   21674600
2019-06-14   18761500
2019-06-17   14651700
2019-06-18   26551000
2019-06-19   21124200
2019-06-20   21514000
2019-06-21   47800600
2019-06-24   18220400
2019-06-25   21047200
2019-06-26    7247616

[2387 rows x 6 columns], 'IBM':                   Open        High         Low       Close   Adj Close  \
Date
2009-12-31  132.410004  132.850006  130.750000  130.899994   98.137283
2010-01-04  131.179993  132.970001  130.850006  132.449997   99.299347
2010-01-05  131.679993  131.850006  130.100006  130.850006   98.099792
2010-01-06  130.679993  131.490005  129.809998  130.000000   97.462532
2010-01-07  129.869995  130.250000  128.910004  129.550003   97.125160
2010-01-08  129.070007  130.919998  129.050003  130.850006   98.099792
2010-01-11  131.059998  131.059998  128.669998  129.479996   97.072685
2010-01-12  129.029999  131.330002  129.000000  130.509995   97.844872
2010-01-13  130.389999  131.119995  129.160004  130.229996   97.634964
2010-01-14  130.550003  132.710007  129.910004  132.309998   99.194389
2010-01-15  132.029999  132.889999  131.089996  131.779999   98.797028
2010-01-19  131.630005  134.250000  131.559998  134.139999  100.566330
2010-01-20  130.460007  131.149994  128.949997  130.250000   97.649979
2010-01-21  130.470001  130.690002  128.059998  129.000000   96.712860
2010-01-22  128.669998  128.889999  125.370003  125.500000   94.088844
2010-01-25  126.330002  126.889999  125.709999  126.120003   94.553688
2010-01-26  125.919998  127.750000  125.410004  125.750000   94.276276
2010-01-27  125.820000  126.959999  125.040001  126.330002   94.711105
2010-01-28  127.029999  127.040001  123.050003  123.750000   92.776848
2010-01-29  124.320000  125.000000  121.900002  122.389999   91.757233
2010-02-01  123.230003  124.949997  122.779999  124.669998   93.466576
2010-02-02  124.790001  125.809998  123.949997  125.529999   94.111336
2010-02-03  125.160004  126.070000  125.070000  125.660004   94.208817
2010-02-04  125.190002  125.440002  122.900002  123.000000   92.214569
2010-02-05  123.040001  123.720001  121.830002  123.519997   92.604401
2010-02-08  123.150002  123.220001  121.739998  121.879997   91.783577
2010-02-09  122.650002  124.199997  122.459999  123.209999   92.785126
2010-02-10  122.940002  123.650002  122.209999  122.809998   92.483902
2010-02-11  122.580002  124.199997  122.059998  123.730003   93.176750
2010-02-12  123.010002  124.050003  121.610001  124.000000   93.380051
...                ...         ...         ...         ...         ...
2019-05-15  132.589996  134.589996  132.369995  134.399994  134.399994
2019-05-16  134.740005  136.110001  134.639999  135.880005  135.880005
2019-05-17  134.679993  135.410004  133.940002  134.320007  134.320007
2019-05-20  133.529999  135.429993  132.929993  135.119995  135.119995
2019-05-21  136.119995  137.059998  135.789993  136.449997  136.449997
2019-05-22  136.000000  136.750000  135.710007  136.350006  136.350006
2019-05-23  135.130005  135.130005  130.440002  132.389999  132.389999
2019-05-24  133.529999  134.250000  131.589996  132.279999  132.279999
2019-05-28  132.130005  132.639999  130.270004  130.460007  130.460007
2019-05-29  130.000000  130.279999  128.320007  129.690002  129.690002
2019-05-30  129.740005  129.970001  128.929993  129.570007  129.570007
2019-05-31  128.440002  128.440002  126.849998  126.989998  126.989998
2019-06-03  127.099998  128.559998  127.059998  128.270004  128.270004
2019-06-04  129.559998  132.740005  129.089996  132.690002  132.690002
2019-06-05  133.380005  133.610001  130.470001  131.490005  131.490005
2019-06-06  132.190002  132.649994  130.899994  132.220001  132.220001
2019-06-07  132.470001  134.720001  132.210007  133.309998  133.309998
2019-06-10  134.380005  135.350006  133.910004  134.740005  134.740005
2019-06-11  135.320007  136.460007  135.050003  135.949997  135.949997
2019-06-12  135.559998  135.940002  134.410004  134.869995  134.869995
2019-06-13  135.130005  136.270004  135.089996  135.759995  135.759995
2019-06-14  135.440002  135.880005  134.429993  135.149994  135.149994
2019-06-17  135.389999  136.029999  134.699997  134.949997  134.949997
2019-06-18  135.199997  137.190002  135.199997  136.380005  136.380005
2019-06-19  136.429993  138.360001  136.240005  137.080002  137.080002
2019-06-20  138.929993  139.539993  138.199997  138.850006  138.850006
2019-06-21  138.440002  139.539993  138.389999  139.199997  139.199997
2019-06-24  139.199997  140.149994  139.050003  139.350006  139.350006
2019-06-25  139.460007  139.550003  138.130005  138.360001  138.360001
2019-06-26  138.869995  139.679993  138.651993  139.369995  139.369995

              Volume
Date
2009-12-31   4223400
2010-01-04   6155300
2010-01-05   6841400
2010-01-06   5605300
2010-01-07   5840600
2010-01-08   4197200
2010-01-11   5730400
2010-01-12   8081500
2010-01-13   6455400
2010-01-14   7111800
2010-01-15   8494400
2010-01-19  13916200
2010-01-20  15197500
2010-01-21   9608600
2010-01-22  10088600
2010-01-25   5738500
2010-01-26   7135300
2010-01-27   8719200
2010-01-28   9622200
2010-01-29  11571200
2010-02-01   7242900
2010-02-02   5899900
2010-02-03   4177100
2010-02-04   9126900
2010-02-05   8617000
2010-02-08   5718500
2010-02-09   6044500
2010-02-10   5219100
2010-02-11   5089000
2010-02-12   8017700
...              ...
2019-05-15   2551000
2019-05-16   3017300
2019-05-17   2619100
2019-05-20   3264500
2019-05-21   2503500
2019-05-22   1849800
2019-05-23   5343400
2019-05-24   2596100
2019-05-28   4908800
2019-05-29   3679000
2019-05-30   2741900
2019-05-31   3539300
2019-06-03   4266900
2019-06-04   3913500
2019-06-05   3161300
2019-06-06   2298200
2019-06-07   2553400
2019-06-10   2911300
2019-06-11   3407300
2019-06-12   2254700
2019-06-13   2955300
2019-06-14   2193300
2019-06-17   2194100
2019-06-18   2914700
2019-06-19   2382400
2019-06-20   3071000
2019-06-21   5288700
2019-06-24   2186000
2019-06-25   2801200
2019-06-26    372574

[2387 rows x 6 columns], 'MSFT':                   Open        High         Low       Close   Adj Close  \
Date
2009-12-31   30.980000   30.990000   30.480000   30.480000   24.152580
2010-01-04   30.620001   31.100000   30.590000   30.950001   24.525019
2010-01-05   30.850000   31.100000   30.639999   30.959999   24.532942
2010-01-06   30.879999   31.080000   30.520000   30.770000   24.382378
2010-01-07   30.629999   30.700001   30.190001   30.450001   24.128809
2010-01-08   30.280001   30.879999   30.240000   30.660000   24.295214
2010-01-11   30.709999   30.760000   30.120001   30.270000   23.986179
2010-01-12   30.150000   30.400000   29.910000   30.070000   23.827694
2010-01-13   30.260000   30.520000   30.010000   30.350000   24.049570
2010-01-14   30.309999   31.100000   30.260000   30.959999   24.532942
2010-01-15   31.080000   31.240000   30.709999   30.860001   24.453693
2010-01-19   30.750000   31.240000   30.680000   31.100000   24.643881
2010-01-20   30.809999   30.940001   30.309999   30.590000   24.239746
2010-01-21   30.610001   30.719999   30.000000   30.010000   23.780155
2010-01-22   30.000000   30.200001   28.840000   28.959999   22.948128
2010-01-25   29.240000   29.660000   29.100000   29.320000   23.233395
2010-01-26   29.200001   29.850000   29.090000   29.500000   23.376024
2010-01-27   29.350000   29.820000   29.020000   29.670000   23.510740
2010-01-28   29.840000   29.870001   28.889999   29.160000   23.106604
2010-01-29   29.900000   29.920000   27.660000   28.180000   22.330048
2010-02-01   28.389999   28.480000   27.920000   28.410000   22.512297
2010-02-02   28.370001   28.500000   28.139999   28.459999   22.551926
2010-02-03   28.260000   28.790001   28.120001   28.629999   22.686628
2010-02-04   28.379999   28.500000   27.809999   27.840000   22.060629
2010-02-05   28.000000   28.280001   27.570000   28.020000   22.203266
2010-02-08   28.010000   28.080000   27.570000   27.719999   21.965540
2010-02-09   27.969999   28.340000   27.750000   28.010000   22.195339
2010-02-10   28.030001   28.240000   27.840000   27.990000   22.179491
2010-02-11   27.930000   28.400000   27.700001   28.120001   22.282507
2010-02-12   27.809999   28.059999   27.580000   27.930000   22.131947
...                ...         ...         ...         ...         ...
2019-05-15  124.260002  126.709999  123.699997  126.019997  126.019997
2019-05-16  126.750000  129.380005  126.459999  128.929993  128.929993
2019-05-17  128.309998  130.460007  127.919998  128.070007  128.070007
2019-05-20  126.519997  127.589996  125.760002  126.220001  126.220001
2019-05-21  127.430000  127.529999  126.580002  126.900002  126.900002
2019-05-22  126.620003  128.240005  126.519997  127.669998  127.669998
2019-05-23  126.199997  126.290001  124.739998  126.180000  126.180000
2019-05-24  126.910004  127.419998  125.970001  126.239998  126.239998
2019-05-28  126.980003  128.000000  126.050003  126.160004  126.160004
2019-05-29  125.379997  125.389999  124.040001  124.940002  124.940002
2019-05-30  125.260002  125.760002  124.779999  125.730003  125.730003
2019-05-31  124.230003  124.620003  123.320000  123.680000  123.680000
2019-06-03  123.849998  124.370003  119.010002  119.839996  119.839996
2019-06-04  121.279999  123.279999  120.650002  123.160004  123.160004
2019-06-05  124.949997  125.870003  124.209999  125.830002  125.830002
2019-06-06  126.440002  127.970001  125.599998  127.820000  127.820000
2019-06-07  129.190002  132.250000  128.259995  131.399994  131.399994
2019-06-10  132.399994  134.080002  132.000000  132.600006  132.600006
2019-06-11  133.880005  134.240005  131.279999  132.100006  132.100006
2019-06-12  131.399994  131.970001  130.710007  131.490005  131.490005
2019-06-13  131.979996  133.000000  131.559998  132.320007  132.320007
2019-06-14  132.259995  133.789993  131.639999  132.449997  132.449997
2019-06-17  132.630005  133.729996  132.529999  132.850006  132.850006
2019-06-18  134.190002  135.240005  133.570007  135.160004  135.160004
2019-06-19  135.000000  135.929993  133.809998  135.690002  135.690002
2019-06-20  137.449997  137.660004  135.720001  136.949997  136.949997
2019-06-21  136.580002  137.729996  136.460007  136.970001  136.970001
2019-06-24  137.000000  138.399994  137.000000  137.779999  137.779999
2019-06-25  137.250000  137.589996  132.729996  133.429993  133.429993
2019-06-26  134.350006  135.729996  134.360001  134.789993  134.789993

               Volume
Date
2009-12-31   31929700
2010-01-04   38409100
2010-01-05   49749600
2010-01-06   58182400
2010-01-07   50559700
2010-01-08   51197400
2010-01-11   68754700
2010-01-12   65912100
2010-01-13   51863500
2010-01-14   63228100
2010-01-15   79913200
2010-01-19   46575700
2010-01-20   54849500
2010-01-21   73086700
2010-01-22  102004600
2010-01-25   63373000
2010-01-26   66639900
2010-01-27   63949500
2010-01-28  117513700
2010-01-29  193888500
2010-02-01   85931100
2010-02-02   54413700
2010-02-03   61397900
2010-02-04   77850000
2010-02-05   80960100
2010-02-08   52820600
2010-02-09   59195800
2010-02-10   48591300
2010-02-11   65993700
2010-02-12   81117200
...               ...
2019-05-15   24722700
2019-05-16   30112200
2019-05-17   25770500
2019-05-20   23706900
2019-05-21   15293300
2019-05-22   15396500
2019-05-23   23603800
2019-05-24   14123400
2019-05-28   23128400
2019-05-29   22763100
2019-05-30   16829600
2019-05-31   26646800
2019-06-03   37983600
2019-06-04   29382600
2019-06-05   24926100
2019-06-06   21459000
2019-06-07   33885600
2019-06-10   26477100
2019-06-11   23913700
2019-06-12   17092500
2019-06-13   17200800
2019-06-14   17821700
2019-06-17   14496200
2019-06-18   25934500
2019-06-19   23744400
2019-06-20   33042600
2019-06-21   36727900
2019-06-24   20628800
2019-06-25   33301500
2019-06-26    5443929

[2387 rows x 6 columns], 'GOOG':                    Open         High          Low        Close    Adj Close  \
Date
2009-12-31   310.356445   310.679321   307.986847   307.986847   307.986847
2010-01-04   311.449310   312.721039   310.103088   311.349976   311.349976
2010-01-05   311.563568   311.891449   308.761810   309.978882   309.978882
2010-01-06   310.907837   310.907837   301.220856   302.164703   302.164703
2010-01-07   302.731018   303.029083   294.410156   295.130463   295.130463
2010-01-08   294.087250   299.675903   292.651581   299.064880   299.064880
2010-01-11   300.276978   300.276978   295.100647   298.612823   298.612823
2010-01-12   296.893982   297.147339   292.100159   293.332153   293.332153
2010-01-13   286.382355   292.288940   285.095734   291.648102   291.648102
2010-01-14   290.063416   295.180145   289.521942   293.019196   293.019196
2010-01-15   294.752930   294.862213   287.152344   288.126007   288.126007
2010-01-19   288.722137   293.302338   286.283020   291.911407   291.911407
2010-01-20   291.096710   291.096710   285.786224   288.329681   288.329681
2010-01-21   289.834900   291.513977   284.276062   289.606384   289.606384
2010-01-22   280.426086   283.456390   265.701874   273.227905   273.227905
2010-01-25   271.528961   273.163330   266.024780   268.255249   268.255249
2010-01-26   267.246826   273.024231   266.412231   269.457428   269.457428
2010-01-27   268.886169   272.055542   265.925415   269.298462   269.298462
2010-01-28   270.485748   271.732635   263.585632   265.418701   265.418701
2010-01-29   267.505127   268.747070   261.106750   263.257751   263.257751
2010-02-01   265.572693   266.173798   263.436584   264.787811   264.787811
2010-02-02   265.751556   265.751556   262.100281   263.843964   263.843964
2010-02-03   262.626862   269.298462   262.408295   268.662598   268.662598
2010-02-04   266.764954   267.261719   261.081909   261.687958   261.687958
2010-02-05   262.492737   265.026245   259.541931   263.928406   263.928406
2010-02-08   264.529480   269.248810   264.047638   265.011353   265.011353
2010-02-09   268.026733   269.015320   265.806183   266.486755   266.486755
2010-02-10   265.309418   267.157410   262.140045   265.498199   265.498199
2010-02-11   264.936829   268.498688   263.039185   266.466888   266.466888
2010-02-12   264.762970   266.839478   263.535950   264.837494   264.837494
...                 ...          ...          ...          ...          ...
2019-05-15  1117.869995  1171.329956  1116.666016  1164.209961  1164.209961
2019-05-16  1164.510010  1188.160034  1162.839966  1178.979980  1178.979980

In [126]:
price = pd.DataFrame({ticker:data['Adj Close'] for ticker, data in all_data.items()})

In [ ]:
volume = pd.DataFrame(ticker:data['Volume'] for ticker, data in all_data.items())

In [ ]:
returns = price.pct_change()

In [128]:
returns.tail()

NameError: name 'returns' is not defined

In [129]:
returns.tail()

NameError: name 'returns' is not defined

In [130]:
returns

NameError: name 'returns' is not defined

In [131]:
returns = price.pct_change()

In [132]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2019-06-20  0.008036  0.008246  0.012912  0.009286
2019-06-21 -0.003409  0.009411  0.002521  0.000146
2019-06-24 -0.001006 -0.005669  0.001078  0.005914
2019-06-25 -0.015158 -0.026149 -0.007104 -0.031572
2019-06-26  0.022652  0.000865  0.007300  0.010193

In [133]:
returns['MSFT'].corr(returns['IBM'])

0.4871374708752565

In [134]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.460953  0.379530  0.453246
GOOG  0.460953  1.000000  0.403088  0.537985
IBM   0.379530  0.403088  1.000000  0.487137
MSFT  0.453246  0.537985  0.487137  1.000000

In [135]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000266  0.000116  0.000076  0.000107
GOOG  0.000116  0.000239  0.000077  0.000120
IBM   0.000076  0.000077  0.000152  0.000087
MSFT  0.000107  0.000120  0.000087  0.000209

In [137]:
returns.corrwith(volume)

NameError: name 'volume' is not defined

In [138]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [139]:
uniques = obj.unique()

In [140]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [141]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [142]:
pd.value_counts(obj.values,sort=False)

a    3
d    1
b    2
c    3
dtype: int64

In [143]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [144]:
mask = obj.isin(['b','c'])

mask

In [145]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [146]:
to_match = pd.Series(['c','a','b','b','e','a'])

In [147]:
unq = pd.Series(['c','b','a'])

In [148]:
pd.Index(unq).get_indexer(to_match)

array([ 0,  2,  1,  1, -1,  2])

In [149]:
data = pd.DataFrame({'q1':[1,3,4,5,6]},{'q2':[2,3,4,6,2]},{'q3':[1,5,4,2,1]})

In [150]:
data

     q3
q2  NaN

In [151]:
result = data.apply(pd.value_counts).fillna(0)

In [152]:
result

Empty DataFrame
Columns: [q3]
Index: []